import React, { useState } from "react";

function Geography() {
  const [display, setDisplay] = useState("div-info");

  const closeCard = () => {
    setDisplay("div-info-hidden");
  };

  const openCard = () => {
    setDisplay("div-info");
  };

  return (
    <div>
      <h2 className="title-text">Факти з географії</h2>
      <ul className="flex div-info-gap">
        <li>
          <div className={display}>
            <h3 className="title-content">Азія</h3>
            <p className="text">
              в Азії розташована найвища і найнижча точки світу. Наприклад, гора
              Еверест, розташована на кордоні між Непалом і Китаєм, є найвищою
              горою і найвищою точкою на землі з висотою 8848 метрів над рівнем
              моря, а Мертве море, розташоване між Ізраїлем, Йорданією та
              Палестиною, знаходиться на висоті 430 метрів нижче рівня моря, що
              робить його найнижчою точкою на планеті Земля;
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Європа</h3>
            <p className="text">
              Європа займає площу близько 10 180 000 квадратних кілометрів і є
              третім за чисельністю населення континентом у світі (понад 741
              мільйонів людей). Європа захоплює серця мандрівників, котрі
              кохаються в мистецтві, історії, їжі. Це батьківщина 50 суверенних
              держав. Не можна заперечувати той факт, що Європа є одним із
              найкрасивіших континентів світу.
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Північна Америка</h3>
            <p className="text">
              Північна Америка є третім за величиною континентом у світі із
              загальною площею 24 709 000 квадратних кілометрів. На
              північноамериканському континенті проживає понад 579 мільйонів
              жителів різного походження та культур. Північна Америка, відома
              своїм динамічним способом життя, захоплюючою природою та багатою
              історією.
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Південна Америка</h3>
            <p className="text">
              Континент різких контрастів, Південна Америка, є пристрастю
              мандрівників з усього світу. Це четвертий за величиною континент
              (з площею понад 17 840 000 квадратних кілометрів) і п’ятий за
              чисельністю населення (420 мільйонів людей). Гори Анди -
              найпротяжніший континентальний масив гір у світі.
            </p>
          </div>
        </li>
      </ul>
      <ul className="flex div-info-gap">
        <li>
          <div className={display}>
            <h3 className="title-content">Антарктика</h3>
            <p className="text">
              Антарктика - регіон, який відкрили останнім в історії. Це п'ятий
              за площею та сьомий за чисельністю населення континент у світі, на
              якому живе лише плюс-мінус 1106 осіб, й усі вони є науковими
              дослідниками. Антарктида - найхолодніший, найсухіший і
              найвітряніший материк. Також має найвищу середню висоту з усіх
              континентів світу. Не дивно, що Антарктика - найхолодніша, адже
              зафіксований температурний мінімум аж -89,2 за Цельсієм. Це до
              біса холодно!
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Африка</h3>
            <p className="text">
              Африка, що складається з 54 країн, є другим континентом світу за
              площею та населенням. Африка, відома своїми чаруюючими краєвидами
              та великою різноманітністю видів тварин. Цей континент вартий
              захоплення! Африка - це єдиний континент, який знаходиться в усіх
              чотирьох півкулях - західній, східній, північній і південній -
              справді винятковість!
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Океанія</h3>
            <p className="text">
              Океанія - частина світу із загальною площею понад 8,5 мільйонів
              квадратних кілометрів та населенням у понад 40 мільйонів. Океанія
              складається з Австралії, Меланезії, Мікронезії та Полінезії. Вона
              відома своїм невимушеним способом життя та чудовими пляжами. На
              величезній території Тихого океану розкидано понад 25 000
              вулканічних або тропічних островів.
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Гори</h3>
            <p className="text">
              Найвища вершина на Землі — Джомолунгма, висотою 8848 метрів. При
              цьому гора з найбільшою висотою від основи до вершини — підводний
              вулкан Мауна-Кеа, США, штат Гаваї. Висота Мауна-Кеа — 10203 метра,
              але над рівнем моря цей вулкан височить лише на 4205 метрів.
            </p>
          </div>
        </li>
      </ul>
      <div className="flex div-btn">
        <button onClick={closeCard} className="btn">
          Закрити
        </button>
        <button onClick={openCard} className="btn">
          Відкрити
        </button>
      </div>
    </div>
  );
}

export default Geography;
