import React, { useState } from "react";
import background_image_home from "./images/background_image_home.jpg";

function Home() {
  return (
    <div>
      <h2 className="title-text">РОЗВИТОК ПАМ'ЯТІ</h2>
      <div className="flex div-flex">
      <div>
        <img src={background_image_home} alt="photo" width={800}/>
      </div>
      <div className="div-content">
      <p>
        Розвиток пам’яті – важливий ключ до того, щоб назавжди змінити свій
        спосіб життя. Пам’ять – одна із класичних функцій, яку потрібно
        розвивати постійно.
      </p>
      <p>
        Компанія Inten розробляє унікальний комплекс вправ для покращення
        пам’яті. Якщо ви хочете пам’ятати важливі події вашого життя,
        запам’ятовувати числа, дати, списки, зображення, щоб ніколи не
        потрапляти в незручну ситуацію, потрібно тренувати пам’ять.
      </p>
      <p>
        Кожен тренінг – і для дорослих, і для дітей – буде веселим, повчальним,
        різноманітним, цікавим та головне – дієвим. Зорова, слухова та моторна
        пам’ять максимально покращуються завдяки методиці, що підтверджується
        результатами тестування. Якщо вам це важливо, вибирайте зручний варіант
        тут.
      </p>
      </div>
      </div>
    </div>
  );
}

export default Home;
