import React, { useState } from "react";

function Physics() {
  const [display, setDisplay] = useState("div-info");

  const closeCard = () => {
    setDisplay("div-info-hidden");
  };

  const openCard = () => {
    setDisplay("div-info");
  };

  return (
    <div>
      <h2 className="title-text">Факти з фізики</h2>
      <ul className="flex div-info-gap">
        <li>
          <div className={display}>
            <h3 className="title-content">Швидкість звуку</h3>
            <p className="text">
              Подолати швидкість звуку не так складно, як здається. Кінчик
              звичайного батога при змаху рухається так швидко, що випереджає
              звук. Саме в момент переходу ним звукового бар’єра й лунає хлопок.
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Антиматерія</h3>
            <p className="text">
              Уперше ученим вдалося створити антиматерію в 1965 році. Судячи з
              усього, у природному стані в нашому Всесвіті антиречовина взагалі
              не трапляється, але в лабораторії отримати її можна.
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Щільність води</h3>
            <p className="text">
              Поміж інших цікавих фактів про фізику не можна не згадати й те, що
              щільність води безпосередньо залежить від її температури.
              Максимальна щільність досягається при +4 °C, а замерзлий лід і
              зовсім менш щільний, ніж вода, тому і плаває в ній, а не тоне.
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Ядерний реактор</h3>
            <p className="text">
              Самий справжній ядерний реактор діяв 2 мільярди років тому на
              території Окло. Приблизно 100000 років тривала реакція реактора, і
              тільки тоді, коли виснажилася уранова жила, це завершилося.
            </p>
          </div>
        </li>
      </ul>
      <ul className="flex div-info-gap">
        <li>
          <div className={display}>
            <h3 className="title-content">Погодні умови</h3>
            <p className="text">
              Залежно від погодних умов висота Ейфелевої вежі може коливатися на
              12 сантиметрів. У жарку погоду балки нагріваються до 40 градусів і
              під впливом високих температур розширюються, що і змінює висоту
              даної будови.
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Архімед</h3>
            <p className="text">
              Захищаючи рідне місто Сіракузи від нападу римлян, великий фізик і
              математик Архімед (287-212 рр. до н.е.) так налякав ворогів своїми
              небаченими бойовими машинами, що варто було після цього над
              стінами показати звичайний дрючок або мотузку, як римляни
              розбігалися з криком: – Архімед знову направляє на нас якусь
              машину!
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Як народжується винахід</h3>
            <p className="text">
              Як народжується винахід Ейнштейна одного разу запитали, як, на
              його думку, з'являються винаходи, що перетворюють світ. Дуже
              просто, -відповів він. - Всі знають, що зробити це неможливо.
              Серед них трапляється один дивак, котрий цього не знає. Він і
              робить винахід.
            </p>
          </div>
        </li>
        <li>
          <div className={display}>
            <h3 className="title-content">Ігор Іванович Сікорський</h3>
            <p className="text">
              Ігор Іванович Сікорський – всесвітньо відомий авіаконструктор,
              творець гелікоптерів, творець першого у світі важкого
              бомбардувальника “Ілля Муромець”. Народився в Києві, закінчив
              Київський політехнічний інститут.
            </p>
          </div>
        </li>
      </ul>
      <div className="flex div-btn">
        <button onClick={closeCard} className="btn">
          Закрити
        </button>
        <button onClick={openCard} className="btn">
          Відкрити
        </button>
      </div>
    </div>
  );
}

export default Physics;
